# SpatialFieldMgrDescription Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpatialFieldMgrDescription Property
ParameterTypeId Class See Also
---
"Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpatialFieldMgrDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpatialFieldMgrDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpatialFieldMgrDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace